{
  "articles": [
    {
      "id": 1,
      "title": "Screensports FC Launches Elite Academy Program",
      "excerpt": "We're excited to announce our new Elite Academy Program designed for competitive players aged 13-18 who aspire to play at the collegiate and professional levels.",
      "content": "Screensports FC is proud to introduce our Elite Academy Program, a comprehensive 16-week training curriculum designed for serious players looking to take their game to the next level. The program features advanced tactical training, position-specific coaching, and college recruitment preparation. Led by UEFA A licensed coach Michael Rodriguez, the program includes video analysis sessions, mental preparation workshops, and exposure to college scouts. Training sessions are held three times per week with additional weekend matches against other elite academies. The program has already seen success with several players earning college scholarships and professional trials.",
      "author": "Screensports FC Media Team",
      "date": "2024-01-15",
      "category": "Academy News",
      "image": "/images/news-elite-academy.jpg",
      "tags": [
        "academy",
        "elite",
        "development",
        "college"
      ]
    },
    {
      "id": 2,
      "title": "Youth Development Program Registration Now Open",
      "excerpt": "Registration is now open for our popular Youth Development Program. Spaces are limited for the upcoming season.",
      "content": "The Youth Development Program at Screensports FC is now accepting registrations for the upcoming season. This program is designed for young players aged 6-12 and focuses on developing fundamental football skills in a fun and supportive environment. The 12-week program covers essential techniques including ball control, passing, shooting, and basic tactical understanding. All sessions are led by qualified coaches with extensive experience in youth development. The program emphasizes enjoyment and participation while building a strong foundation for future football development. Parents are encouraged to register early as spaces are limited and the program typically fills up quickly.",
      "author": "Sarah Johnson",
      "date": "2024-01-10",
      "category": "Youth Programs",
      "image": "/images/news-youth-registration.jpg",
      "tags": [
        "youth",
        "registration",
        "development",
        "beginners"
      ]
    },
    {
      "id": 3,
      "title": "New Goalkeeper Academy Announced",
      "excerpt": "Specialized goalkeeper training program launching this spring with expert coaching and modern techniques.",
      "content": "Screensports FC is launching a specialized Goalkeeper Academy this spring, addressing the growing demand for position-specific training. The program will be led by David Thompson, a former Premier League goalkeeper with 15 years of coaching experience. The academy will focus on all aspects of goalkeeping including shot-stopping, positioning, distribution, and communication. Training sessions will incorporate modern techniques and technology, including video analysis and specialized equipment. The program is open to players aged 10-18 and will run for 10 weeks with weekend sessions. Small group sizes ensure personalized attention and maximum development opportunities for each participant.",
      "author": "David Thompson",
      "date": "2024-01-05",
      "category": "Specialized Training",
      "image": "/images/news-goalkeeper-academy.jpg",
      "tags": [
        "goalkeeper",
        "specialized",
        "training",
        "position-specific"
      ]
    },
    {
      "id": 4,
      "title": "Academy Players Selected for Regional Team",
      "excerpt": "Five Screensports FC academy players have been selected for the regional representative team following excellent performances.",
      "content": "Five talented players from Screensports FC have been selected for the regional representative team after impressing scouts during recent tournaments. The players, ranging in age from 14 to 17, demonstrated exceptional skill, dedication, and tactical understanding throughout the selection process. This achievement reflects the quality of coaching and development programs at the academy. The selected players will now represent the region in upcoming competitions against other regional teams. Academy Director Sarah Johnson expressed pride in the players' achievements and credited the comprehensive training programs for their development. The academy continues to produce talented players who excel at higher levels of competition.",
      "author": "Screensports FC Media Team",
      "date": "2024-01-01",
      "category": "Player Achievements",
      "image": "/images/news-regional-selection.jpg",
      "tags": [
        "achievements",
        "regional",
        "selection",
        "talent"
      ]
    }
  ]
}